#include<iostream>
using namespace std;
//实现否定
int Neg(int p)
{
    //在begin-end之间补充代码，实现否定运算
    //*****************begin***********************//
    return !p;
    //*****************end*************************//
}
//实现合取
int Conj(int p,int q)
{
    //在begin-end之间补充代码，实现合取运算
    //*****************begin***********************//
    return p&&q;
    //*****************end*************************//
}
//实现析取
int Dis(int p,int q)
{
    //在begin-end之间补充代码，实现析取运算
    //*****************begin***********************//
    return p||q;
    //*****************end*************************//    
}
//实现蕴含
int Con(int p,int q)
{
    //在begin-end之间补充代码，实现蕴含运算
    //*****************begin***********************//
    return !p||q;
    //*****************end*************************//
}
//实现等值
int Equ(int p,int q)
{
    //在begin-end之间补充代码，实现等值运算
    //*****************begin***********************//
    return p==q;
    //*****************end*************************//
}
int main()
{
    int p,q;
    //输入p，q的真假：0或者1
    cin>>p>>q;
    cout<<"p="<<(p?"真":"假")<<",q="<<(q?"真":"假")<<endl;
    cout<<"非P为"<<(Neg(p)?"真":"假")<<endl;
    cout<<"P合取Q为"<<(Conj(p,q)?"真":"假")<<endl;
    cout<<"P析取Q为"<<(Dis(p,q)?"真":"假")<<endl;
    cout<<"P蕴含Q为"<<(Con(p,q)?"真":"假")<<endl;
    cout<<"P等值Q为"<<(Equ(p,q)?"真":"假")<<endl;
    return 0;
}
